[
  {
    "id": 1,
    "title": "Develop the Oracle of DSCOVR",
    "description": "We designed an advanced forecasting system using the XGBoost Machine Learning Model to predict the Kp Index on Earth, leveraging data from the DSCOVR satellite situated at the L1 point, 1 million km away. This serves as an early warning mechanism for geomagnetic storms. we faced the challenge of data gaps, we introduced an additional time-series model to synthesize data. The significant solution here is harnessing the capability of an older-generation satellite, situated a million km from Earth, to predict potentially impactful geomagnetic disturbances.",
    "img": "images/projects/project1.png",
    "tag": ["All", "FullStack"],
    "technologies": ["HTML", "CSS", "JavaScript", "Svelte", "Python", "AI"],
    "gitUrl": "https://github.com/Sharaf-Mansour/HelioN",
    "previewUrl": "https://www.spaceappschallenge.org/2023/find-a-team/helion/?tab=project",
    "authors": "Omar Ibrahim Salah, Abdallah Samir Alhdad, Omar Mohsen,Sharaf El Dean Mohamed Abd El Khalik Mohamed, Mohammed Tarek Ahmed Ibrahim, Moaaz Tarek Ahmed",
    "category": "Data Science"
  },
  {
    "id": 2,
    "title": "Abalone age prediction",
    "description": "Predicting the age of abalone from physical measurements. The age of abalone is determined by cutting the shell through the cone, staining it, and counting the number of rings through a microscope -- a boring and time-consuming task. Other measurements, which are easier to obtain, are used to predict the age. Further information, such as weather patterns and location (hence food availability) may be required to solve the problem.",
    "img": "images/projects/project2.png",
    "tag": ["All", "BackEnd"],
    "technologies": ["HTML", "CSS", " Python", "Machine Learning", "AI"],
    "gitUrl": "https://github.com/Mohammed0tarek/Abalone-Project",
    "previewUrl": "https://mohammed-tarek.vercel.app/",
    "authors": "Mohammed Tarek Ahmed Ibrahim",
    "category": "Data Science"
  }
]
